# Завдання: Порівняння чисел
# Напишіть програму на Python, яка порівнює два числа, введені користувачем, і виводить більше з них.
#
# Запитайте користувача про перше число.
# Запитайте користувача про друге число.
# Використайте умовний оператор, щоб порівняти ці числа.
# Виведіть більше з чисел.
# Приклад виконання програми:
a = int(input('Введіть перше число: '))
b = int(input('Введіть друге число: '))

if a > b:
    print(f'Перше число {a} > за друге {b}')
elif b > a:
    print(f'Друге число {b} > за перше {a}')
else:
    print('Ці числа рівні')