# Завдання: Калькулятор звичайних математичних операцій
#
# Напишіть програму-калькулятор, яка виконує основні математичні операції з двома числами:
# додавання, віднімання, множення та ділення.
#
# Попросіть користувача ввести перше число.
# Попросіть користувача ввести друге число.
# Виведіть меню з варіантами операцій: "+", "-", "*", "/".
# Попросіть користувача вибрати операцію, введіть відповідний символ операції.
# Виконайте обрану операцію з двома числами та виведіть результат.
# Після виведення результату, спитайте користувача, чи він хоче продовжити використання калькулятора.
# Якщо так, повторіть процес з кроку 1. Якщо ні, завершіть програму.