# Завдання: Калькулятор звичайних математичних операцій
#
# Напишіть програму-калькулятор, яка виконує основні математичні операції з двома числами:
# додавання, віднімання, множення та ділення.
#
# Попросіть користувача ввести перше число.
# Попросіть користувача ввести друге число.
# Виведіть меню з варіантами операцій: "+", "-", "*", "/".
# Попросіть користувача вибрати операцію, введіть відповідний символ операції.
# Виконайте обрану операцію з двома числами та виведіть результат.
# Після виведення результату, спитайте користувача, чи він хоче продовжити використання калькулятора.
# Якщо так, повторіть процес з кроку 1. Якщо ні, завершіть програму.


while True:
    num1 = int(input('Введіть перше число: '))
    num2 = int(input('Введіть друге число: '))

    user_input = input('Введіть операцію (*, /, +, -): ')
    if user_input == '+':
        print(num1 + num2)
    elif user_input == '-':
        print(num1 - num2)
    elif user_input == '*':
        print(num1 * num2)
    elif user_input == '/':
        print(num1 / num2)

    answer = input('Чи хочете ви продовжити взаємодію?(так/ні): ')
    if answer == 'так':
        continue
    else:
        break
